Repository: agile11tiger/Petty
Catalog: Petty/Resources/Localization/AppResources.*.resx
Languages: ru

# BaseSettingsCurrentLanguage
source: Current language (will only be applied after restarting the application):
ru: Текущий язык (применится только после перезапуска приложения):

# BaseSettingsHapticalFeedback
source: Haptic feedback:
ru: Тактильная обратная связь:

# BaseSettingsMode
source: Information perception method:
ru: Способ восприятия информации:

# BaseSettingsModeRead
source: Read
ru: Чтение

# BaseSettingsModeReadDescription
source: all information is displayed on the screen
ru: вся информация отображается на экране

# BaseSettingsModeReadOrVoice
source: ReadOrVoice
ru: ЧтениеИлиГолос

# BaseSettingsModeReadOrVoiceDescription
source: all information is displayed or spoken
ru: вся информация отображается или произносится

# BaseSettingsModeVoice
source: Voice
ru: Голос

# BaseSettingsModeVoiceDescription
source: all information is spoken
ru: вся информация произносится

# ButtonApply
source: Apply
ru: Применить

# ButtonBuyCoffee
source: Buy me a coffee, I'm tired :(
ru: Купите мне кофе, я устал :(

# ButtonCancel
source: Cancel
ru: Отмена

# ButtonClear
source: Clear
ru: Очистить

# ButtonDefault
source: Default
ru: По умолчанию

# ButtonDonate
source: I read all messages personally :)
ru: Все сообщения читаю лично :)

# ButtonDownload
source: Download
ru: Скачать

# ButtonLater
source: Later
ru: Позже

# ButtonMoreDetails
source: more
ru: подробнее

# ButtonNo
source: No
ru: Нет

# ButtonOk
source: Ok
ru: Ок

# ButtonSpeak
source: Speak
ru: Сказать

# ButtonStartStop
source: Start/Stop
ru: Старт/Стоп

# ButtonYes
source: Yes
ru: Да

source: Command
ru: Команда

# CommandBattery
source: battery charge
ru: заряд батареи

# CommandBatteryCharging
source: Yay! Food
ru: Ура! Еда

# CommandBatteryDescription
source: notifies you of the current battery charge
ru: уведомляет о текущем заряде батареи

# CommandBatteryFull
source: I'm full
ru: Я наелся

# CommandCall
source: call
ru: позвони

# CommandCallContactNotFound
source: {0} not found.
ru: {0} не найден.

# CommandCallDescription
source: makes a call if the given user was found in your contacts list.
ru: делает вызов, если данный пользователь был найден в вашем списке контактов.

# CommandCallExtendedDescription
source: Makes a call if the given user was found in your contacts list. If several contacts with a given name are found, then a choice is offered and you need to answer: “zero”, “first” or “one”, etc. up to 9 inclusive, no longer supported.
ru: Делает вызов, если данный пользователь был найден в вашем списке контактов. Если найдено несколько контактов с данным названием, то предлагается выбор и нужно ответить: "нулевой" или "ноль", "первый" или "один" и т.д до 9 включительно, больше не поддерживается. Для вашего удобства добавлено склонение имен и фамилий, при условии, сначало имя, потом фамилия, дальше все остальное. Все символы кроме букв удаляются, поэтому у контакта "Тигр Тигров9 (друг)" останется "Тигр Тигров друг" и будут доступны следующие команды: 1. Петти позвони Тигр Тигров друг 2. Петти позвони Тигру Тигрову друг

# CommandCallNotPhoneNumbers
source: {0} phone number was not found.
ru: У {0} номер телефона не найден.

# CommandCallSelectNumberFromList
source: Select number from the list.
ru: Выберите номер из списка.

# CommandDeviceInfo
source: device info
ru: характеристики телефона

# CommandDeviceInfoDescription
source: notifies you about the phone's characteristics
ru: уведомляет о характеристиках телефона

# CommandDial
source: dial
ru: набери

# CommandDialDescription
source: dials a phone number, dialing is supported both with and without the +1 prefix. After dialing, you need to check that the number you dialed is correct and say “call.”
ru: набирает номер телефона, поддерживается набор, как с префиксом +7 или 8, так и без. После набора нужно проверить правильность набраного номера и сказать "позвони" или "позвонить".

# CommandExceptionInCode
source: Sorry, there was an error in my code and the command couldn't be executed. Cry, cry.
ru: Прости, в моем коде произошла ошибка и не получилось выполнить команду. Плак, плак.

# CommandFlashlight
source: flashlight
ru: фонарик

# CommandFlashlightDescription
source: turns the flashlight on/off
ru: включает/выключает фонарик

# CommandFlashlightExtendedDescription
source: Turns the flashlight on/off. If the flashlight was already turned on outside the application, then the first call will turn on the turned on flashlight, and the second will turn it off.
ru: Включает/выключает фонарик. Если фонарик был уже включен вне приложения, то первый вызов включит включенный фонарик, а второй отключит.

# CommandHelp
source: help
ru: помогите

# CommandHelpDescription
source: sends out if people have been pre-selected and turns on a siren (optional) for help.
ru: рассылает, если были заранее выбраны люди и включает сирену (по желанию) о помощи.

# CommandPetName
source: petty
ru: пэтти

# CommandPickFiles
source: pick files
ru: выбрать файлы

# CommandPickFilesDescription
source: opens a list to select files
ru: открывает список для выбора файлов

# CommandPickImages
source: pick images
ru: выбрать фото

# CommandPickImagesDescription
source: opens a list for selecting images
ru: открывает список для выбора изображений

# CommandPickVideoFiles
source: pick video
ru: выбрать видео

# CommandPickVideoFilesDescription
source: opens a list for selecting video files
ru: открывает список для выбора видео файлов

# CommandScreenshot
source: screenshot
ru: скриншот

# CommandScreenshotDescription
source: takes a screenshot.
ru: делает снимок экрана.

# CommandsTitle
source: Commands
ru: Команды

# CommandsTitleUsefulFeatures
source: Useful features:
ru: Полезные фичи:

# CommandTakePhoto
source: take photo
ru: сделать фото

# CommandTakePhotoDescription
source: opens a window for taking photographs
ru: открывает окно для фотографирования

# CommandTakeVideo
source: take video
ru: сделать видео

# CommandTakeVideoDescription
source: opens a window for creating a video file
ru: открывает окно для создания видео файла

# CommandWordCancel
source: cancel
ru: отмена

# CommandWordNo
source: no
ru: нет

# DeviceInfo
source: Device information
ru: Информация об устройстве

# DeviceInfoDensity
source: Density
ru: Плотность

# DeviceInfoHeight
source: Height
ru: Высота

# DeviceInfoHertz
source: Hz
ru: Гц

# DeviceInfoManufacturer
source: Manufacturer
ru: Производитель

# DeviceInfoModel
source: Model
ru: Модель

# DeviceInfoOSVersion
source: Version OS
ru: Версия ОС

# DeviceInfoPixel
source: px
ru: пикселей

# DeviceInfoPlatform
source: Platform
ru: Платформа

# DeviceInfoRefreshRate
source: RefreshRate
ru: Частота обновления

# DeviceInfoWidth
source: Width
ru: Ширина

# PageAbout
source: About
ru: Информация

# PageBaseSettings
source: Base settings
ru: Базовые настройки

# PageDiagnostics
source: Diagnostics
ru: Диагностика

# PageHelp
source: Help
ru: Помощь

# PageLeaderboard
source: Leaderboard
ru: Таблица лидеров

# PagePetty
source: Petty
ru: Пэтти

# PageSettings
source: Settings
ru: Настройки

# PageSpeechSimulator
source: Simulator speech
ru: Тренажёр речи

# PageVoiceSettings
source: Voice
ru: Голос

# TitleDownloading
source: Downloading
ru: Скачивание

# UserMessageCheckNetworkConnection
source: Check your network connection and try again.
ru: Проверьте соединение к сети и попробуйте снова.

# UserMessageCommandNotAvailable
source: The command is not available at the moment.
ru: В данный момент команда недоступна.

# UserMessageCommandNotSupported
source: This command is not supported on this device.
ru: Эта команда не поддерживается на этом устройстве.

# UserMessageDisablePettyGuard
source: Are you sure you want to disable Petty's protection?
ru: Вы точно хотите отключить защиту Пэтти?

# UserMessageDownloadingInProgress
source: Downloading in progress, please wait for it to complete.
ru: Идёт скачивание, подождите его завершения...

# UserMessageDownloadVoskModelMessage
source: For start voice recognizing you need to download a voice model (about 128 MB)
ru: Для начала распознавания голоса вам необходимо скачать модель голоса (около 45 МБ)

# UserMessagePettySpeechSimulatorPlaceholder
source: People don't understand what you say, but do you think your speech is normal? There is a solution!!! Petty speech simulator will help you in this difficult task. Just start talking and it will show you what people hear. Learn to speak clearly, good luck!)
ru: Люди не понимают, что вы говорите, но вам кажется ваша речь нормальной? Решение есть!!! Петти тренажер для речи поможет вам в этом непростом деле. Просто начни говорить, а он покажет, что слышат люди. Научись говорить внятно, удачи!)

# UserMessagePettyStartStopRemark
source: P.S. This button starts and stops Petty's voice assistant throughout the application.
ru: П.С. Это кнопка запускает и останавливает голосового помощника Петти во всем приложении.

# UserMessageTryLater
source: This operation is already in progress. Please try again later.
ru: Эта операция уже выполняется. Пожалуйста, повторите попытку позже.

# VoiceSettingsEditorVoiceTestSpeech
source: Hello leather bag, how are you?
ru: Привет, кожаный мешок, как дела?

# VoiceSettingsPitch
source: Pitch
ru: Подача

# VoiceSettingsValue
source: Value: {0}
ru: Значение: {0}

# VoiceSettingsVolume
source: Volume
ru: Громкость
